# GetDiscipline Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
UnitUtils..::..GetDiscipline Method
UnitUtils Class See Also
---
Gets the discipline for a given spec.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static ForgeTypeId GetDiscipline(
	ForgeTypeId specTypeId
)
```

Visual Basic
---
```text
Public Shared Function GetDiscipline ( _
	specTypeId As ForgeTypeId _
) As ForgeTypeId
```

Visual C++
---
```text
public:
static ForgeTypeId^ GetDiscipline(
	ForgeTypeId^ specTypeId
)
```

# ### Parameters
specTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId Identifier of the spec.
# ### Return Value
Identifier of the discipline.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId). |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
UnitUtils Class
Autodesk.Revit.DB Namespace